//
// This file is part of the GNU ARM Eclipse distribution.
// Copyright (c) 2014 Liviu Ionescu.
//

#ifndef __DELAY_H_
#define __DELAY_H_

#include "cmsis_device.h"

// ----------------------------------------------------------------------------

#define DELAY_MS_HZ (1000u)
#define DELAY_US_HZ (1000000u)

//重定义延时时间数为32位int型
typedef uint32_t delay_ticks_t;

extern volatile delay_ticks_t delay_InterruptCount;

/*******************************************************************************
 * 函数名称 : delay_init
 * 函数介绍 : 定时器初始化
 * 参数介绍 : 无
 * 返回值  : 无
 ******************************************************************************/
extern void delay_init (void);
/*******************************************************************************
 * 函数名称 : delay_us
 * 函数介绍 : 延时US的时间,定时范围 < 233ms
 * 参数介绍 : nus : 要延时的微妙数
 * 返回值   :无
 ******************************************************************************/
extern void delay_us(u32 nus);
/*******************************************************************************
 * 函数名称 : delay_ms
 * 函数介绍 : 延时MS的时间
 * 参数介绍 : nms : 要延时的毫秒数
 * 返回值   :无
 ******************************************************************************/
extern void delay_ms(u32 nms);
// ----------------------------------------------------------------------------

#endif // __DELAY_H_
