#ifndef __MPUIIC_H
#define __MPUIIC_H
#include "PIN.h"
#include "Delay.h"
#include "stm32f10x.h"
#include "stm32f10x_conf.h"

//IO方向设置
#define MPU_SDA_IN()  {GPIOB->CRH&=0XFFFF0FFF;GPIOB->CRH|=8<<12;}
#define MPU_SDA_OUT() {GPIOB->CRH&=0XFFFF0FFF;GPIOB->CRH|=3<<12;}

//IO操作函数
#define MPU_IIC_SCL    PBout(10) 		//SCL
#define MPU_IIC_SDA    PBout(11) 		//SDA
#define MPU_READ_SDA   PBin(11) 		//输入SDA

//IIC所有操作函数
/*-----------------------------------------------------------------------------
 * 函数名称 ：MPU_IIC_Delay
 * 函数介绍 ：MPU IIC 延时函数
 * 参数介绍 ：无
 * 返回值     ：无
 *---------------------------------------------------------------------------*/
extern void MPU_IIC_Delay(void);



/*-----------------------------------------------------------------------------
 * 函数名称 ：MPU_IIC_Init
 * 函数介绍 ：初始化IIC
 * 参数介绍 ：无
 * 返回值     ：无
 *---------------------------------------------------------------------------*/
extern void MPU_IIC_Init(void);

/*-----------------------------------------------------------------------------
 * 函数名称 ：MPU_IIC_Start
 * 函数介绍 ：产生IIC起始信号
 * 参数介绍 ：无
 * 返回值     ：无
 *---------------------------------------------------------------------------*/
extern void MPU_IIC_Start(void);


/*-----------------------------------------------------------------------------
 * 函数名称 ：MPU_IIC_Stop
 * 函数介绍 ：产生IIC停止信号
 * 参数介绍 ：无
 * 返回值     ：无
 *---------------------------------------------------------------------------*/
extern void MPU_IIC_Stop(void);

/*-----------------------------------------------------------------------------
 * 函数名称 ：MPU_IIC_Wait_Ack
 * 函数介绍 ：等待应答信号到来
 * 参数介绍 ：无
 * 返回值     ：无
 *---------------------------------------------------------------------------*/
extern u8 MPU_IIC_Wait_Ack(void);


/*-----------------------------------------------------------------------------
 * 函数名称 ：MPU_IIC_Ack
 * 函数介绍 ：产生ACK应答
 * 参数介绍 ：无
 * 返回值     ：无
 *---------------------------------------------------------------------------*/
extern void MPU_IIC_Ack(void);


/*-----------------------------------------------------------------------------
 * 函数名称 ：MPU_IIC_NAck
 * 函数介绍 ：不产生ACK应答
 * 参数介绍 ：无
 * 返回值     ：无
 *---------------------------------------------------------------------------*/
extern void MPU_IIC_NAck(void);


/*-----------------------------------------------------------------------------
 * 函数名称 ：MPU_IIC_Send_Byte
 * 函数介绍 ：IIC发送一个字节
 * 参数介绍 ：无
 * 返回值     ：1：有应答，0：无应答
 *---------------------------------------------------------------------------*/
extern void MPU_IIC_Send_Byte(u8 txd);


/*-----------------------------------------------------------------------------
 * 函数名称 ：MPU_IIC_Read_Byte
 * 函数介绍 ：读1个字节
 * 参数介绍 ：ack=1时，发送ACK，ack=0，发送nACK
 * 返回值     ：读取到的字节
 *---------------------------------------------------------------------------*/
extern u8 MPU_IIC_Read_Byte(unsigned char ack);
#endif

