#ifndef __SYS_H_
#define __SYS_H_
#include "PIN.h"
#include <stdio.h>
#include "stm32f10x.h"
#include "stm32f10x_conf.h"

//以下为汇编函数
/*-----------------------------------------------------------------------------
 *函数名称  ： WFI_SET
 *函数介绍  ：使用内嵌汇编，
 *参数介绍  ：无
 *返回值      ：无
 *---------------------------------------------------------------------------*/
extern void WFI_SET(void);

/*-----------------------------------------------------------------------------
 *函数名称  ： MSR_MSP
 *函数介绍  ：使用内嵌汇编， 设置栈顶地址
 *参数介绍  ：addr  :  要设置的地址
 *返回值      ：无
 *---------------------------------------------------------------------------*/
extern void MSR_MSP(u32 addr);


/*-----------------------------------------------------------------------------
 *函数名称  ： INTX_ENABLE
 *函数介绍  ：使用内嵌汇编， 开启所有中断
 *参数介绍  ：无
 *返回值      ：无
 *---------------------------------------------------------------------------*/
extern void INTX_ENABLE(void);


/*-----------------------------------------------------------------------------
 *函数名称  ： INTX_DISABLE
 *函数介绍  ：使用内嵌汇编， 关闭所有中断
 *参数介绍  ：无
 *返回值      ：无
 *---------------------------------------------------------------------------*/
extern void INTX_DISABLE(void);

#endif  //__SYS_H_
