/*
 * usart.h
 *
 *  Created on: 2016骞�10鏈�8鏃�
 *      Author: Administrator
 */

#ifndef USART_H_
#define USART_H_
#include "stm32f10x.h"
#include "stm32f10x_conf.h"
#include "PIN.h"

#define RX_BUFFER_SIZE  			200  	//接收缓冲区长度

/*******************************************************************************
 * 函数名称 : sendString
 * 函数介绍 : 发送一个字符串
 * 参数介绍 : str : 要发送的字符串
 * 			len : 字符串的长度
 * 返回值   : 无
 ******************************************************************************/
extern void sendString(unsigned char *str, int len);

/*******************************************************************************
 * 函数名称 : sendChar
 * 函数介绍 : 发送一个字符
 * 参数介绍 : ch : 要发送的字符
 * 返回值   : 要发送的ch
 ******************************************************************************/
extern int sendChar(int ch);


/*******************************************************************************
 * 函数名称 : sendNewLine
 * 函数介绍 : 发送换行符
 * 参数介绍 : 无
 * 返回值  :  无
 ******************************************************************************/
extern void sendNewLine();


/*******************************************************************************
 * 函数名称 : readChar
 * 函数介绍 : 读取字符
 * 参数介绍 : ch  :  读取的字符存放位置
 * 返回值  :  无
 ******************************************************************************/
extern char readChar();

/*******************************************************************************
 * 函数名称 : readString
 * 函数介绍 : 读取字符串
 * 参数介绍 : str  :  读取字符串暂存的位置
 * 			len  :   要读取的位数
 * 返回值  :  正真读取的位数
 ******************************************************************************/
extern int readString(char * str, int len);


/*******************************************************************************
 * 函数名称 : readStringWait
 * 函数介绍 : 阻塞读取字符串
 * 参数介绍 : str  :  读取字符串暂存的位置
 * 			len  :   将会读取的位数
 * 返回值  :  无
 ******************************************************************************/
extern void readStringWait(char * str, int len);

/*******************************************************************************
 * 函数名称 : readStringRaw
 * 函数介绍 : 阻塞读取一行，或者用户能存储的最大字符串
 * 参数介绍 : str  :  读取字符串暂存的位置
 * 			len  :   将会读取的位数
 * 返回值  :  无
 ******************************************************************************/
extern int readStringRaw(char * str, int len);
/*******************************************************************************
 * 函数名称 : uart_init
 * 函数介绍 : 串口初始化
 * 参数介绍 : bound : 波特率
 * 返回值   :无
 ******************************************************************************/
extern void uart_init(u32 bound);

#endif /* USART_H_ */
